# Given DataFrame

In [143]:
import pandas as pd
import numpy as np
import re

In [144]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [145]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Q)Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

# Answer for Question 1

In [146]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [147]:
for i in range(df['FlightNumber'].count()):
    if pd.isnull(df['FlightNumber'].loc[i]):
        df['FlightNumber'].loc[i] = df['FlightNumber'].loc[i-1] + 10

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [148]:
df['FlightNumber']

0    10045.0
1    10055.0
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [149]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [150]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [151]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Q) The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

# Answer for Question 2

In [152]:
df['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [153]:
from_city_list=[]
to_city_list=[]
for i in range(df['From_To'].count()):
    word = df['From_To'].loc[i]
    from_city,to_city = re.split('_',word)
    from_city_list.append(from_city)
    to_city_list.append(to_city)

In [154]:
from_city_list

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [155]:
to_city_list

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [156]:
df_temp = df

In [157]:
df_temp['from_city']=from_city_list

In [158]:
df_temp['to_city']=to_city_list

In [159]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,from_city,to_city
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

# Answer for Question 3

Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [170]:
df_temp['From_To'] = df_temp['From_To'].str.capitalize()

In [171]:
df_temp['from_city'] = df_temp['from_city'].str.capitalize()

In [172]:
df_temp['to_city'] = df_temp['to_city'].str.capitalize()

In [173]:
df_temp

,From_To,FlightNumber,RecentDelays,Airline,from_city,to_city
0,London_paris,10045,"[23, 47]",KLM(!),London,Paris
1,Madrid_milan,10055,[],<Air France> (12),Madrid,Milan
2,London_stockholm,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_paris,10075,[13],12. Air France,Budapest,Paris
4,Brussels_london,10085,"[67, 32]","""Swiss Air""",Brussels,London

# Answer for Question 4

Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [176]:
df_temp = df_temp.drop('From_To',axis = 1)

In [177]:
df_temp

   FlightNumber  RecentDelays              Airline from_city    to_city
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# Answer for Question 5

In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [179]:
df_delays=pd.DataFrame(df_temp["RecentDelays"].values.tolist())

In [180]:
df_delays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [184]:
cols = df_delays.shape[1]

In [185]:
df_delays.columns = ['delay_{}'.format(n) for n in range(1, cols+1)]
df_delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [186]:
df_temp=df_temp.drop("RecentDelays" , axis=1).join(df_delays)
df_temp

,FlightNumber,Airline,from_city,to_city,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN